do
 function run(msg, matches)
 if matches[1] == 'irancell' then
    if matches[2] == 'etebari' then
	return [[
راهنمای مشترکان سیم کارت اعتباری
 (USSD)کد دستوری
تلفن گویا (IVR)	عملکرد
*۵۵۵#
۷۰۰	منوی اصلی
-	۷۰۰-۰	اتصال به اپراتور
*۵۵۵*۵#
۷۰۰-۶	خرید بسته‌های اینترنت
*555*1*4#
-	اطلاع از باقیمانده بسته اینترنت همراه
*141*10#
-	استعلام حساب کلی بسته‌های اینترنت
*4444*3#
-	بسته ترکیبی من
*۵۵۵*۱*۲#
۷۰۰-۱	استعلام مانده حساب
*۵۵۵*۴*۳#
۷۰۰-۲	منوی تغییر زبان
*۵۵۵*۴*۳*۱#
۷۰۰-۲-۱	تغییر زبان به فارسی
*۵۵۵*۴*۳*۲#
۷۰۰-۲-۲	تغییر زبان به انگلیسی
-
۷۰۰-۳	منوی خدمات ام تی ان ایرانسل
*۵۵۵*۴*۵*۱#
۷۰۰-۳-۱-۱
فعال سازی پیام گیری صوتی
*۵۵۵*۴*۵*۲#
۷۰۰-۳-۱-۳
فعال سازی تماس های ناموفق
*۵۵۵*۴*۵*۳#
۷۰۰-۳-۱-۴
حذف تمامی خدمات پیام گیر
*۵۵۵*۴*۱#
۷۰۰-۳-۵
درخواست تنظیمات MMS
*۵۵۵*۴*۲#
۷۰۰-۳-۶
درخواست تنظیمات اینترنت همراه
*۵۵۵*۳*۷*۳#
-
مشاهده فهرست طلایی
*۱۴۱*شماره رمز ۱۲ یا ۱۶ رقمی#
۷۰۰-۴-رمز ۱۲ یا ۱۶ رقمی
شارژ مجدد
*۱۴۴*شماره رمز ۱۲ رقمی#
-	شارژ شگفت انگیز
*۱۴۲*رمز*مبلغ به ریال*شماره مقصد#
۷۰۰-۳-۸
سرویس خط به خط
*۵۵۵*۳#
۷۰۰-۷	منوی تغییر طرح تعرفه
*۵۵۵*۳*۴#
۷۰۰-۷-۱
طرح های تعرفه اعتباری
*۵۵۵*۱*۹#  یا *i۷۰#
۷۰۰-۷-۴
انتقال از اعتباری به دائمی
*۵۵۵*۳#
۷۰۰-۷-۵
طرح های تعرفه تشویقی
*555*3*8#
۷۰۰-۷-۸
منوی اطلاعات حساب
*555*3*8#
۷۰۰-۷-۸-۱
طرح تعرفه فعلی
*555*3*9#
۷۰۰-۷-۸-۲
دوره باقیمانده از طرح تعرفه تشویقی
	]]
	end
	if matches[2] == 'wimax' then
	return [[
	راهنمای کاربران وایمکس
  کد دستوری(USSD)	  تلفن گویا(IVR)	عملکرد
*707#	707	منوی اصلی
*707*1#	707-1-1-1	اطلاعات حساب
*707*1*1#	-	اطلاعات حساب و شناسه پرداخت
*707*1*2#	-	باقی مانده بسته افزایشی
*707*1*3#	-	اطلاع از طرح تعرفه
*707*1*4#	-	اطلاع از مبلغ بدهی و وضعیت حساب کاربری
*707*2#	-	تغییر زبان
*707*2*1#	707-1	تغییر زبان به فارسی
*707*2*2#	707-2	تغییر زبان به انگلیسی
*707*6#	-	بارگذاری کارت شارژ
-	707-1-1-2	پرداخت
-	707-1-1-3	بسته افزایشی
-	707-1-1-4	طرح تعرفه
-	707-1-1-5	رمز عبور وایمکس
-	707-1-1-0	اتصال به اپراتور
	]]
	end
	if matches[2] == 'daemi' then
	return [[
	راهنمای مشترکان سیم کارت دائمی
 (USSD) کد دستوری
تلفن گویا (IVR)	عملکرد
*۵۵۵#
۷۰۰	منوی اصلی
-	۷۰۰-۰	اتصال به اپراتور
*۵۵۵*۵#
۷۰۰-۶	خرید بسته‌های اینترنت
*555*1*4#
-	اطلاع از باقیمانده بسته اینترنت همراه
*۵۵۵*۱#
۷۰۰-۱	منوی اطلاعات حساب
*۵۵۵*۱*۲#
۷۰۰-۱-۱	استعلام مانده حساب و کد شناسه
*۵۵۵*۳*۸#
۷۰۰-۱-۲	طرح تعرفه فعلی
*۵۵۵*۴*۳#
۷۰۰-۲	منوی تغییر زبان
*۵۵۵*۴*۳*۱#
۷۰۰-۲-۱	تغییر زبان به فارسی
*۵۵۵*۴*۳*۲#
۷۰۰-۲-۲	تغییر زبان به انگلیسی
-
۷۰۰-۳	منوی خدمات ام تی ان ایرانسل
*۵۵۵*۴*۵#
۷۰۰-۳-۱	منوی خدمات پیامگیر و بازیابی تماس ناموفق
*۵۵۵*۴*۵*۱#
۷۰۰-۳-۱-۱	فعال سازی پیامگیر صوتی
*۵۵۵*۴*۵*۲#
۷۰۰-۳-۱-۳	فعال سازی بازیابی تماس های ناموفق
*۵۵۵*۴*۵*۳#
۷۰۰-۳-۱-۴	حذف تمامی خدمات پیام گیر
*۵۵۵*۳*۷*۳#
۷۰۰-۳-۴-۳
مشاهده فهرست طلایی
*۵۵۵*۴*۱#
۷۰۰-۳-۵
درخواست تنظیمات MMS
*۵۵۵*۴*۲#
۷۰۰-۳-۶
درخواست تنظیمات اینترنت همراه
*۵۵۵*۳#
۷۰۰-۷	منوی تغییر طرح تعرفه
*۱۳۰*شماره رمز ۱۲ یا ۱۶رقمی#
-	پرداخت صورتحساب دائمی از طریق کارت شارژ
	]]
	end
	if matches[2] == 'pishvaz' then
	return [[
	نحوه حذف، تغییر، جایگزینی و خرید آهنگ پیشواز ایرانسل

 

راهنمای بکارگیری آهنگ پیشواز(فعالسازی،حذف و …)

 

1- از طریق ارسال پیام کوتاه

 شما می توانید دستور مورد نظر خود را در یک پیام کوتاه به
شماره ۷۵۷۵ ارسال کنید. در این حالت نتیجه درخواست شما بلافاصله در یک پیام کوتاه
برای شما ارسال خواهد شد.

عملیات و دستورهای زیر از طریق پیام کوتاه قابل ارسال است:

عملیات

شکل دستور

مثال

تک آهنگی

چند آهنگی

خرید آهنگ	
کدآهنگK

K100100

•

•

حذف آهنگ خریداری شده	
کدآهنگHZ

HZ100100

•

•

1- انصراف از خدمات آهنگ پیشواز	
ENS

ENS

•

•

2- غیرفعال سازی موقت	
GHFA

GHFA

•

•

فعال سازی (در صورت غیرفعال بودن)	
FA

FA

•

•

جستجو بر اساس کد آهنگ	
کد مورد
نظرJK

JK100123

•

•

مشاهده جدیدترین آهنگ ها	
J

J

•

•

3- مشاهده آلبوم	
A

A

•

•

مشاهده ۱۰ آهنگ برتر	
DAH

DAH

•

•

جایگزینی رایگان آهنگ
 

(در دوره مجاز پس از خرید)

 کدآهنگ موجودTV

 

کدآهنگ
جایگزین

TV100100 100123

×

•

راهنمایی	
R

R

×

•

4- تغییر حالت پخش	
TH

TH

×

•

5- تمدید آهنگ (خرید مجدد)	
کدآهنگT

T100100

×

•

6- تنظیم آهنگ برای تماس گیرنده خاص	
کدآهنگTZ

شماره تماس گیرنده

TZ100100 ۹۸۹۳۵۱۲۳۴۵۶۷

×

•

7- حذف تمامی تنظیمات یک تماس گیرنده خاص	
HB

شماره تماس
گیرنده

HB 989351234567

×

•

8- حذف تنظیمات یک آهنگ برای یک تماس گیرنده خاص	
HB

شماره تماس
گیرنده

کد آهنگ

HB 989351234567100100

×

•

حذف تمامی تنظیمات مربوط به یک آهنگ خاص	
کدآهنگ HT

HT 100100

×

•

مشاهده آهنگهای پیشنهادی	
PI

PI

×

•

مشاهده فهرست پخش پیش فرض	
L

L

×

•

فقط خریداری، بدون تنظیم برای فهرست پخش پیش فرض	
کد آهنگFKH

FKH 100100

×

•

9- اضافه کردن آهنگ از آلبوم به فهرست پیش فرض	
کد
آهنگP

P100100

×

•

 

توضیحات:

1) با ارسال این دستور سرویس آهنگ پیشواز شما غیر فعال شده و آهنگ های موجود در آلبوم شما حذف می شوند.

2) ارسال این دستور مشترک می تواند سرویس را به طور موقت غیر فعال کند.

3) منظور از آلبوم، مجموعه آهنگ های پیشواز خریداری شده شما است که دوره اعتبار آنها هنوز باقیست.

4) حالت های پخش آهنگ پیشواز عبارتند از حالت پخش تک آهنگی و چند آهنگی.

5) با این دستور شما می توانید یکی از آهنگ های موجود در آلبوم خود را مجددا خریداری کنید.

6) با این دستور شما می توانید مثلا یکی از آهنگ های آلبوم خود را برای یک تماس گیرنده خاص تنظیم کنید.

7) با این دستور شما می توانید تمامی تنظیمات ذخیره شده برای یک تماس گیرنده را حذف کنید.

8) با این دستور شما می توانید تنظیمات یک آهنگ انتخابی برای یک تماس گیرنده را حذف کنید.

9) با این دستور شما می توانید آهنگ مشخصی را خریداری کرده و به آلبوم اضافه نمایید، اما لزوما از آن بر روی فهرست پخش پیش فرض استفاده نمی کنید.

 

 

2- از طریق استفاده از کدهای دستوری (USSD)

شما می توانید بخشی از عملیات متفاوت آهنگ پیشواز را با استفاده از
کدهای دستوری انجام دهید. برای دیدن منوی اصلی آهنگ پیشواز ، #۷۷۷* را از خط
ایرانسل خود شماره گیری کنید و سپس یکی از گزینه های منو را انتخاب کنید.

شما همچنین می توانید مستقیما
کدهای زیر را شماره گیری کنید.

 

عملیات

کد دستوری

انتخاب حالت پخش تک آهنگی	۱*۱*۷۷۷*#
انتخاب حالت پخش چند آهنگی	#۲*۱*۷۷۷*
مشاهده آلبوم	#۲*۷۷۷*
مشاهده فهرست پخش پیش فرض	#۳*۷۷۷*
خرید	#کد آهنگ*۴*۷۷۷*
حذف	#کد آهنگ*۵*۷۷۷*
جایگزینی	#کد آهنگ جایگزین*کد آهنگ موجود*۶*۷۷۷*
جستجو	#کد آهنگ*۷*۷۷۷*
غیرفعال سازی موقت	#۲*۸*۷۷۷*
فعال سازی مجدد	#۱*۸*۷۷۷*
	]]
	end 
	if matches[2] == 'gprs' then 
	return [[
	فعال سازی GPRS / EDGE / 3G / 4G
شما با استفاده از gprs ایرانسل، که تکنولوژی جدیدتر آن همان edge است، و در مناطقی که پوشش ۳G و ۴G وجود دارد، با اینترنت ۳G و ۴G می‌توانید در هر جایی که ایرانسل خط دهی دارد، با استفاده از موبایل خود به اینترنت متصل شوید. برای فعال کردن این سرویس روی سیمکارت خود، کد دستوری زیر را وارد کنید:

*130*3*6#[yes/ok]
پس از وارد کردن این کد، یک پیامک (configuration message) حاوی تنظیمات gprs ایرانسل به گوشی شما ارسال می‌شود و شما باید آن را install یا save کنید. هنگام نصب از شما pin یا رمز خواسته می‌شود و شما باید رمز ۱۲۳۴ را وارد کنید، تا gprs‌ سیم‌کارت شما فعال شود.
روش دیگر برای دریافت تنظیمات gprs، ارسال یک پیامک به شماره ۲۲۲۵ به شکل زیر است:
S [phone brand] [phone model]
لحظاتی پس از ارسال این پیامک، شما پیامی حاوی تنظیمات gprs و mms دریافت خواهید کرد که باید آن را Save یا Install کنید. حالا، شما می‌توانید با روشن کردن packet data از قسمت تنظیمات Network یا Connectivity گوشی خود، به اینترنت متصل شوید. البته ممکن است بعد از فعالسازی، چند ساعت طول بکشد تا اینترنت برای گوشی شما فعال شود. زمانی که اینترنت همراه گوشی شما فعال شود و به درستی کار کند، یک آیکون کوچک (متشکل از حرف E یا G یا Y واحتمالا با دو عدد فلش برعکس) در بالای صفحه گوشی شما نمایش داده می‌شود.

مدل گوشی شما در شبکه ایرانسل موجود نیست؟ >  تنظیمات دستی GPRS ایرانسل

ممکن است شما از طریق روش‌های بالا اقدام به فعال‌سازی جی پی آر اس خود کنید، اما پیغام دریافت کنید که مدل گوشی شما در سیستم ثبت نشده. این پیام گاهی در اثر خطای در سرورهای ایرانسل اتفاق می‌افتد (یعنی در حالی که تنظیمات وجود دارد، به اشتباهَ این پیام فرستاده می‌شود). قبل از هر کاری، چند دقیقه صبر کنید و کد دستوری که در بالا گفته شده است را دوباره وارد کنید. اما اگر پس از چند بار درخواست فعال‌سازی، دوباره با همان پیام مواجه شدید، در این صورت،‌ نوبت به تنظیمات دستی gprs می‌رسد. شما باید شخصا تنظیمات را در گوشی خود وارد کنید. نحوه وارد کردن دستی تنظیمات gprs ایرانسل در گوشی‌ها و سیستم‌عامل‌های مختلف متفاوت، ولی شبیه به یکدیگر است. ما در اینجا به علت رواج بیشتر، این فرآیند را برای گوشی‌های لمسی آندرویدی سامسونگ توضیح می‌دهیم. بقیه مدل‌ها نیز سازوکاری کمابیش مشابه خواهند داشت. برای تنظیم دستی gprs به شیوه‌ی زیر عمل کنید:

۱. به مسیر زیر بروید (منظور از Menu همان دکمه منوی گوشی شماست):

Menu> Settings> Wireless and network > Mobile networks > Access Point Names > Menu >Add New Apn

۲. در صفحه‌ای که نمایش داده می‌شود، طبق جدول زیر موارد خواسته شده را وارد کنید:

نام	مقدار
Name	Irancell-GPRS
APN	mtnirancell
Proxy	۱۰.۱۳۱.۲۶.۱۳۸
Port	۸۰۸۰
۳. دکمه Menu و سپس Save را بزنید.

۴. در صفحه‌ی لیست پروفایل‌ها، مطمئن شوید پروفایلی که اکنون درست کردید (Irancell-GPRS) انتخاب شده باشد.

۵. الان باید بتوانید به اینترنت وصل شوید.

خب؛ حالا که اینترنت همراه ایرانسل خود را فعال کردید، بهتر است به فکر هزینه‌های آن نیز باشید. اگر هیچ بسته‌ای را خریداری نکرده باشید، هزینه‌ی اینترنت شما به صورت آزاد، و بر مبنای میزان کیلوبایت ارسالی و دریافتی از گوشی شما محاسبه می‌شود. هر کیلوبایت ارسال یا دریافت اطلاعات از اینترنت، برای سیم‌کارت دائمی ۰.۵ ریال و در سیم‌کارت اعتباری ۰.۷۵ ریال برای شما هزینه دارد. اما اگر استفاده‌ی شما از اینترنت، از یکی دو ساعت در هفته بیشتر است، توصیه می‌کنیم یکی از بسته‌های تخفیفی اینترنت همراه ایرانسل را فعال کنید

بسته‌های تخفیفی اینترنت GPRS ،EDGE ،۳G یا ۴G ایرانسل
بسته های تخفیفی EDGE و GPRS ایرانسلفعال کردن این بسته ها باعث صرفه‌جویی تا بیش از ۹۰ درصد در هزینه اینترنت ایرانسل شما می‌شود. شما می‌توانید بر اساس نیاز خود، یکی از بسته های تخفیفی ارائه شده توسط ایرانسل را فعال کنید. بسته های تخفیفی مختلف ایرانسل، قیمت هر کدام از بسته‌ها، و کد فعال کردن بسته های تخفیفی ایرانسل برای سیمکارت های ثابت و اعتباری در ادامه آمده است.

بسته‌های اینترنت همراه gprs ایرانسل با دستور *۵۵۵*#

یک روش برای خریداری بسته‌های اینترنت همراه ایرانسل، استفاده از کد دستوری ۵۵۵ است. روش فعال‌سازی و جزئیات این بسته‌ها را در جدول زیر می‌بینید:

فعال سازی بسته‌های اینترنت ایرانسل با کد دستوری ۵۵۵ و تعرفه‌های بسته‌ها
مهلت استفاده	حجم	قیمت	کد فعال سازی (اعتباری و دائمی)
۱ روزه	۱۵ مگابایت	۵,۰۰۰ ریال	*۵۵۵*۵*۱*۱#
۳۰ مگابایت	۹,۰۰۰ ریال	*۵۵۵*۵*۱*۹#
۱ گیگابایت (۲ تا ۸ صبح – فقط اعتباری)	۱۰,۰۰۰ ریال	*۵۵۵*۵*۱*۷#
۱۲۰ مگابایت	۱۸,۰۰۰ ریال	*۵۵۵*۵*۱*۱۲#
۲۰۰ مگابایت (فقط اعتباری)	۲۵,۰۰۰ ریال	*۵۵۵*۵*۱*۵#
۳۰۰ مگابایت	۴۰,۰۰۰ ریال	*۵۵۵*۵*۵*۱#
۵۰۰  مگابایت	۶۰,۰۰۰ ریال	*۵۵۵*۵*۱*۳#
۷ روزه	۴۰ مگابایت	۱۵,۰۰۰ ریال	*۵۵۵*۵*۲*۸#
۶۰ مگابایت	۲۰,۰۰۰ ریال	*۵۵۵*۵*۲*۱۰#
۱۰۰ مگابایت	۲۵,۰۰۰ ریال	*۵۵۵*۵*۲*۲#
۲۰۰ مگابایت	۴۰,۰۰۰  ریال	*۵۵۵*۵*۲*۳#
۳۰۰ مگابایت	۵۰,۰۰۰ ریال	*۵۵۵*۵*۲*۱#
۵ گیگابایت	۱۷۵,۰۰۰ ریال	*۵۵۵*۵*۸*۱#
۱ گیگابایت (۹شب تا ۹ صبح – فقط اعتباری)	۴۰,۰۰۰ ریال	*۵۵۵*۵*۲*۱۱#
۳ گیگابایت (۶۰۰ مگابایت دائمی و ۲۴۰۰ مگابایت ۲ تا ۹ صبح – فقط اعتباری	۸۰,۰۰۰ ریال	*۵۵۵*۵*۲*۵#
۳۰ روزه	۲۰۰ مگابایت	۵۰,۰۰۰ ریال	*۵۵۵*۵*۳*۱#
۳۵۰ مگابایت	۷۰,۰۰۰ ریال	*۵۵۵*۵*۳*۱۰#
۴۰۰ مگابایت	۸۰,۰۰۰ ریال	*۵۵۵*۵*۳*۱۱#
۲۴ گیگابایت (۲ تا ۸ صبح)
ویژه مشترکین اعتباری	۱۰۰,۰۰۰ ریال	*۵۵۵*۵*۳*۹#
۳ گیگابایت  (۵۰۰ مگابایت + ۲/۵ گیگابایت ۹ شب تا ۹ صبح – فقط اعتباری)	۱۰۰,۰۰۰ ریال	*۵۵۵*۵*۳*۶#
۲/۵ گیگابایت (۱ گیگابایت + ۱.۵ گیگابایت ۱۲ شب تا ۱۲ ظهر – فقط اعتباری)	۱۰۰,۰۰۰ ریال	*۵۵۵*۵*۳*۲#
۳ گیگابایت (۱گیگابایت + ۲ گیگابایت ۹ شب تا ۹ صبح – فقط اعتباری	۱۳۰,۰۰۰ ریال	*۵۵۵*۵*۳*۷#
۵ گیگابایت	۲۰۰,۰۰۰ ریال	*۵۵۵*۵*۸*۲#
۱۰ گیگابایت	۳۲۵,۰۰۰ ریال	*۵۵۵*۵*۸*۳#
۲۰ گیگابایت	۵۰۰,۰۰۰ ریال	*۵۵۵*۵*۸*۴#
۳ ماهه	۶ گیگابایت	۲۵۰,۰۰۰ ریال	*۵۵۵*۵*۸*۵#
۹ گیگابایت	۳۲۵,۰۰۰ ریال	*۵۵۵*۵*۴*۷#
۱۲ گیگابایت	۳۷۵,۰۰۰ ریال	*۵۵۵*۵*۸*۷#
۱۵ گیگابایت	۴۵۰,۰۰۰ ریال	*۵۵۵*۵*۸*۸#
۱۸ گیگابایت	۴۷۵,۰۰۰ ریال	*۵۵۵*۵*۸*۹#
۳۰ گیگابایت	۶۰۰,۰۰۰ ریال	*۵۵۵*۵*۸*۱۰#
۵۰ گیگابایت	۷۵۰,۰۰۰ ریال	*۵۵۵*۵*۸*۱۱#
۶ ماهه	۹ گیگابایت (فقط اعتباری)	۳۵۰,۰۰۰ ریال	*۵۵۵*۵*۴*۱۲#
۳۰ گیگابایت	۶۰۰,۰۰۰ ریال	*۵۵۵*۵*۴*۱#
۱۲ ماهه	۱۲ گیگابایت	۴۲۰,۰۰۰ ریال	*۵۵۵*۵*۴*۱۳#
۱۰۰ گیگابایت	۱,۷۵۰,۰۰۰ ریال	*۵۵۵*۵*۸*۱۳#
نکته: ایرانسل مدام شرایط و تعداد بسته‌های اینترنت خود را تغییر می‌دهد که این امر تا حدی به سردرگمی کاربران نیز منجر شده است. برای مشاهده‌‌ی آخرین وضعیت بسته‌ها می‌توانید به صفحه بسته‌های اینترنت همراه در وبسایت ایرانسل مراجعه کنید.

اگر به خاطر سپاری کدهای بالا برایتان مشکل است، کافی است کد «ستاره ۵۵۵ مربع» را به خاطر بسپارید. با زدن این کد منویی ظاهر می‌شود که شما می‌توانید با طی مراحل موجود در منو، به هر کدام از بسته های فوق برسید.

توجه داشته باشید که در سیم‌کارت شما اعتباری است، برای فعال کردن هر کدام از بسته‌ها، باید حداقل به همان میزان شارژ در سیمکارتتان موجود باشد. همچنین دقت داشته باشید که شما نمی‌توانید از شارژ شگفت‌انگیز برای فعال کردن بسته‌های اینترنت ایرانسل استفاده کنید. اگر شارژ سیمکارت شما کم است، ابتدا از طریق خرید شارژ اینترنتی، شارژ مستقیم ایرانسل، یا کد دستوری *۷۸۹*۹۹۹# یا روش‌های دیگر، سیمکارت خود را به میزان لازم شارژ کنید.

برای اطلاع از وضعیت بسته‌های تخفیفی، کد زیر را شماره گیری کنید:
*140*3*7*1#

قابلیت تمدید بسته‌های اینترنت همراه ایرانسل

در صورتی که پیش از پایان دوره‌ی یک بسته، بسته‌ی دیگری را فعال کنید، حجم باقی‌مانده‌ی بسته‌ی قبلی نمی‌سوزد و به بسته‌ی بعدی منتقل می‌شود. انتقال حجم به دوره‌ی بعدی، حداکثر تا ۹۰ روز امکان‌پذیر است. البته این امر شامل بسته‌های بلندمدت (سه ماهه و بیشتر) و بسته‌های شبانه نمی‌شود.

تمدید خودکار بسته‌های اینترنت ایرانسل

بسته‌های هفتگی و ماهانه پس از پایان مهلت استفاده، به صورت خودکار تمدید می‌شوند. شما می توانید در صورت تمایل، با شماره‌گیری کد *۵۵۵*۵*۹# فهرست بسته‌های با قابلیت تمدید خودکار را دریافت کنید. برای لغو این قابلیت کافیست با شماره‌گیری کد مذکور،گزینه لغو بسته را انتخاب نمایید.

شارژ ویژه GPRS
یک روش آسان و سریع برای بهره‌مندی از بسته‌های تخفیفی اینترنت gprs ایرانسل، شارژ سیمکارت ایرانسل با استفاده از شارژ ویژه gprs است. در این روش، شما پس از خرید شارژ، کد شارژ را به جای ۱۴۱، با عدد ۱۴۵ وارد می‌کنید:
*145*charge-code#[yes/ok]

به این ترتیب، یکی از طرح‌های زیر با توجه به مبلغ کارت شارژی که وارد کرده اید، برای شما فعال می‌شود:

شارژ ایرانسل ویژه gprs
نوع شارژ	حداکثر حجم استفاده	مهلت استفاده
۱۰۰۰ تومانی	۴۰ مگابایت	۳ روز
۲۰۰۰ تومانی	۱۰۰ مگابایت	۵ روز
۵۰۰۰ تومانی	۲۷۰ مگابایت	۱۰ روز
۱۰۰۰۰ تومانی	۶۰۰ مگابایت	۱۵ روز
۲۰۰۰۰ تومانی	۲ گیگابایت	۲۰ روز
توجه داشته باشید که شارژی که به این روش وارد می‌کنید، صرف هزینه‌ی gprs شما می‌شود و امکان استفاده از این شارژ برای مکالمه و پیامک وجود ندارد.

اطلاع از میزان شارژ بسته GPRS یا EDGE یا اینترنت ۳G و ۴G ایرانسل
برای اطلاع از میزان باقی مانده اعتبار بسته اینترنت ایرانسل خود، دو راه پیش رو دارید:

۱. از طریق تلفن همراه و کد دستوری: کد دستوری زیر را در تلفن همراه خود وارد کنید تا از میزان اعتبار بسته‌ی خود مطلع شوید:

hesab-gprs-irancell

 

برای استعلام مانده حساب بسته اینترنت سه ماهه، شش ماهه و یکساله، کد *۵۵۵*۱*۴*۴# را شماره گیری نمایید.

۲. از طریق اینترنت و بخش e-care وب‌سایت ایرانسل: ایرانسل این امکان رو اضافه کرده که از طریق وب‌سایت، از حساب gprs خودتون مطلع بشید. کافیه به سایت ایرانسل برید و وارد قسمت ecare بشید. پس از انتخاب زبان، روی لینک کنترل حساب اینترنتی تلفن همراه کلیک کنید، وارد بخش ecare شده و حساب خودتون رو ملاحظه کنید. برای ورود، به شماره سیم‌کارت ایرانسل، و رمز دوم سیم‌کارت نیاز خواهید داشت. برای دریافت رمز ورود کافیه یک بار با استفاده از سیم‌کارت ایرانسلتون یه پیامک خالی به شماره ۱۳۰ بفرستید.
	]]
	end
	if not matches[2] then 
	return [[
	دستورات موجود :
	
	
	/irancell etebari = تمامی کد های سیمکارت اعتباری
	/irancell wimax = تمامی کد های وایمکس ایرانسل
	/irancell daemi = تمامی کد های سیمکارت دائمی 
	/irancell pishvaz = اموزش نصب پیشواز + کد ها
	/irancell gprs = اموزش نصب اینترنت 4 جی پرسرعت ایرانسل
	]]
	end
end
end
end
return {
patterns = {
"^[/!#](irancell) (etebari)$",
"^[/!#](irancell) (wimax)$",
"^[/!#](irancell) (daemi)$",
"^[/!#](irancell) (pishvaz)$",
"^[/!#](irancell) (gprs)$",
"^[/!#](irancell)$",
},
run = run
}
